In [20]:
import pandas as pd
import numpy as np
import sqlalchemy
import datetime
from sql_functions import *
import dotenv
import psycopg2

In [18]:
from sqlalchemy import create_engine

importing the csv in df

In [4]:
sales_before_df=pd.read_csv('Data/my_sales_before_14010624.csv' , encoding='utf_16_le')

In [5]:
sales_before_df

,TRANSACTION_ID,TRANSACTION_DATE,CUSOMER_ID,PRODUCT_TYPE,PRODUCTID,CNT,APPNAME
0,1063609024,5/31/2022 3:50:54 PM,190959,1,779,1,Web
1,1064338610,7/2/2022 11:00:52 AM,190959,1,779,1,Mobile
2,1065032817,8/1/2022 1:04:24 PM,190959,1,780,1,Web
3,1065775681,9/2/2022 4:26:38 PM,190959,1,780,1,Mobile
4,1063648132,6/2/2022 12:47:48 PM,190962,2,87,1,Mobile
...,...,...,...,...,...,...,...
1692037,1064532375,7/9/2022 7:36:42 PM,375919,1,782,1,Mobile
1692038,1063790745,6/9/2022 8:04:51 AM,375921,1,780,1,Mobile
1692039,1064176352,6/26/2022 10:06:06 AM,375921,1,782,1,Mobile
1692040,1064804419,7/22/2022 9:29:28 AM,375921,1,782,1,Mobile
1692041,1065389693,8/16/2022 11:12:23 PM,375921,1,781,1,Mobile

In [6]:
sales_after_df=pd.read_csv('Data/my_sales_after_14010624.csv' , encoding='utf_16_le')

In [7]:
sales_after_df

,TRANSACTION_ID,TRANSACTION_DATE,CUSOMER_ID,PRODUCT_TYPE,PRODUCTID,CNT,APPNAME
0,1066492863,10/2/2022 10:29:18 AM,190959,1,933,1,Mobile
1,1067065226,11/2/2022 2:53:23 PM,190959,1,933,1,Mobile
2,1066498962,10/2/2022 4:29:29 PM,190961,1,932,1,Web
3,1067188219,11/8/2022 9:33:35 PM,190961,1,932,1,Web
4,1066231924,9/21/2022 9:39:35 PM,190962,2,87,2,Mobile
...,...,...,...,...,...,...,...
1153792,1066561552,10/5/2022 9:44:44 PM,699959,2,87,1,Mobile
1153793,1066664884,10/11/2022 2:25:22 PM,699959,1,936,1,Mobile
1153794,1067222806,11/10/2022 2:58:11 PM,699959,1,516,1,Mobile
1153795,1066884679,10/23/2022 2:21:25 AM,699960,1,960,1,Web
1153796,1066851632,10/21/2022 1:08:39 PM,699962,1,955,1,Web

In [8]:
#turn all column names to lower case
sales_before_df.columns=[col.lower() for col in sales_before_df.columns]
sales_after_df.columns=[col.lower() for col in sales_after_df.columns]

In [9]:
sales_before_df.dtypes

transaction_id       int64
transaction_date    object
cusomer_id           int64
product_type         int64
productid            int64
cnt                  int64
appname             object
dtype: object

In [10]:
# to convert date column from string to datetime
sales_before_df['transaction_date_formatted'] = pd.to_datetime(sales_before_df['transaction_date'], format='%m/%d/%Y %I:%M:%S %p' , errors='coerce')
sales_after_df['transaction_date_formatted'] = pd.to_datetime(sales_after_df['transaction_date'], format='%m/%d/%Y %I:%M:%S %p' , errors='coerce')

In [11]:
#dropping the old date columns
sales_before_df.drop('transaction_date' , axis=1 , inplace=True)
sales_after_df.drop('transaction_date' ,axis=1,  inplace=True)

In [12]:
sales_after_df.rename(columns={'transaction_date_formatted': 'transaction_date'} , inplace=True)
sales_after_df

,transaction_id,cusomer_id,product_type,productid,cnt,appname,transaction_date
0,1066492863,190959,1,933,1,Mobile,2022-10-02 10:29:18
1,1067065226,190959,1,933,1,Mobile,2022-11-02 14:53:23
2,1066498962,190961,1,932,1,Web,2022-10-02 16:29:29
3,1067188219,190961,1,932,1,Web,2022-11-08 21:33:35
4,1066231924,190962,2,87,2,Mobile,2022-09-21 21:39:35
...,...,...,...,...,...,...,...
1153792,1066561552,699959,2,87,1,Mobile,2022-10-05 21:44:44
1153793,1066664884,699959,1,936,1,Mobile,2022-10-11 14:25:22
1153794,1067222806,699959,1,516,1,Mobile,2022-11-10 14:58:11
1153795,1066884679,699960,1,960,1,Web,2022-10-23 02:21:25
1153796,1066851632,699962,1,955,1,Web,2022-10-21 13:08:39

In [13]:
sales_before_df.rename(columns={'transaction_date_formatted': 'transaction_date'} , inplace=True)
sales_before_df

,transaction_id,cusomer_id,product_type,productid,cnt,appname,transaction_date
0,1063609024,190959,1,779,1,Web,2022-05-31 15:50:54
1,1064338610,190959,1,779,1,Mobile,2022-07-02 11:00:52
2,1065032817,190959,1,780,1,Web,2022-08-01 13:04:24
3,1065775681,190959,1,780,1,Mobile,2022-09-02 16:26:38
4,1063648132,190962,2,87,1,Mobile,2022-06-02 12:47:48
...,...,...,...,...,...,...,...
1692037,1064532375,375919,1,782,1,Mobile,2022-07-09 19:36:42
1692038,1063790745,375921,1,780,1,Mobile,2022-06-09 08:04:51
1692039,1064176352,375921,1,782,1,Mobile,2022-06-26 10:06:06
1692040,1064804419,375921,1,782,1,Mobile,2022-07-22 09:29:28
1692041,1065389693,375921,1,781,1,Mobile,2022-08-16 23:12:23

In [16]:
sales_before_df.dtypes

transaction_id               int64
cusomer_id                   int64
product_type                 int64
productid                    int64
cnt                          int64
appname                     object
transaction_date    datetime64[ns]
dtype: object

In [39]:
table_name = 'sales_before'
conn=get_engine()
sales_before_df.to_sql(table_name, conn, if_exists='replace', index=False)

42

In [48]:
#schema_name='capstone'
table_name ='sales_after'
conn=get_engine()
sales_after_df.to_sql(table_name, conn, if_exists='replace', index=False)

797

In [51]:
engine=get_engine()
df=get_dataframe('''
                 select * 
                 from information_schema.tables 
                WHERE table_schema='capstone'
                ''')
df

,table_catalog,table_schema,table_name,table_type,self_referencing_column_name,reference_generation,user_defined_type_catalog,user_defined_type_schema,user_defined_type_name,is_insertable_into,is_typed,commit_action
0,postgres,capstone,dim_product,BASE TABLE,None,None,None,None,None,YES,NO,None
1,postgres,capstone,raw_table_before,BASE TABLE,None,None,None,None,None,YES,NO,None
2,postgres,capstone,Customer_clusters,BASE TABLE,None,None,None,None,None,YES,NO,None
3,postgres,capstone,raw_table_after,BASE TABLE,None,None,None,None,None,YES,NO,None
4,postgres,capstone,sales_after,BASE TABLE,None,None,None,None,None,YES,NO,None
5,postgres,capstone,sales_before,BASE TABLE,None,None,None,None,None,YES,NO,None
6,postgres,capstone,customer_data,BASE TABLE,None,None,None,None,None,YES,NO,None